---
kind: type
id: T:Autodesk.Revit.DB.CADLinkType
source: html/593779f4-d044-ba36-1888-969743ce782a.htm
---
# Autodesk.Revit.DB.CADLinkType

CADLinkType represents both CAD links and CAD imports. The
 function IsLink can be used to distinguish between the two.
 CAD imports are not ExternalFileReferences; they are brought
 completely into the document and maintain no connection to
 their original file.

## Syntax (C#)
```csharp
public class CADLinkType : ElementType
```